---
kind: property
id: P:Autodesk.Revit.DB.PrintParameters.ReplaceHalftoneWithThinLines
source: html/ebe646d0-c98f-915d-cf66-dde6fdf5d48c.htm
---
# Autodesk.Revit.DB.PrintParameters.ReplaceHalftoneWithThinLines Property

Indicates whether to replace halftone with thin lines when printing.

## Syntax (C#)
```csharp
public bool ReplaceHalftoneWithThinLines { get; set; }
```